// Сообщение Премиум меню
export default async (ctx) => {
	return (`🌟 <b>Почему вам нужна премиум подписка на наш канал?</b>

Вы уже знакомы с нашим каналом, где мы публикуем интересные Раздачи. Давайте рассмотрим, как премиум подписка может сделать ваше участие более гибким! 🏆

✨ <b>Без премиум подписки:</b>

Вы можете участвовать только в 2 раздачах без пометки ⭐️.
Вы не можете участвовать в Раздача для Премиум-пользователей!

✨ <b>С премиум подпиской:</b>

Уберите все ограничения! Вы можете участвовать в бесконечном количестве раздач.
Получите доступ к эксклюзивным премиум раздачам! 🎁 

Будьте первыми! Премиум подписчики получают информацию о новых раздачах раньше остальных, что позволяет не упустить уникальные предложения.`)
}