// Сообщение "Результаты раздачи"
export function ResultMessage(promotion, winners) {
	return (`<b>✨ Итоги <a href="${process.env.TELEGRAM_CHANEL_URL}/${promotion.messages.public_id}">${promotion.title}</a></b>\n\nДорогие друзья! Мы рады подвести итоги нашей очередной Раздачи и поздравить победителей! 🏆\n\n🥳 Поздравляем наших победителей:\n\n<blockquote expandable>${winners.join('\n')}</blockquote>\n\n💬 Чтобы получить свой приз, пишите нам в Телеграм ${process.env.TELEGRAM_SUPPORT} ! Мы будем ждать ваших сообщений! 🚀`);
};

// Сообщение "Оповещение о победе"
export function WinnerMessage(promotion, post) {
	return (`🔥 <b>УРА! ВЫ ПОБЕДИЛИ!</b> 🔥\n\nДорогой друг, твоя удача сегодня на высоте! Ты выиграл в нашей раздаче <a href="${process.env.TELEGRAM_CHANEL_URL}/${promotion.messages.public_id}">${promotion.title}</a>!\n\n👉 Чтобы получить подарок напиши: <blockquote expandable>СВОЙ ЛОГИН И СЕРВЕР мне @gar_sem Оплата производится только через https://majestic-rp.ru/donate</blockquote>\n👉 Пост в канале: ${post}\n\nНевероятно рады за тебя! 🥳`);
};